zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense.h
/***************************************************************************//**
* \file cy_capsense.h
* \version 10.0.0
*
* \brief
* This file includes all the header files of the CAPSENSE&trade; middleware.
*
********************************************************************************
* \copyright
* (c) 2018-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/

/**
********************************************************************************
* \mainpage
********************************************************************************
* CAPSENSE&trade; is a capacitive sensing solution from Infineon 
* Technologies AG. Capacitive sensing can be used in a variety of applications
* and products where conventional mechanical buttons can be replaced with
* sleek human interfaces to transform the way users interact with electronic
* systems. These include home appliances, and automotive, IoT, and
* industrial applications. CAPSENSE&trade; supports multiple interfaces
* (widgets) using CSD, CSX, and ISX sensing methods with robust performance.
*
* CAPSENSE&trade; has become a popular technology to replace conventional
* mechanical- and optical-based user interfaces. There are fewer parts
* involved, which saves cost and increases reliability with no wear-and-tear.
* The main advantages of CAPSENSE&trade; compared with other solutions are:
* robust performance in harsh environmental conditions and rejection of a
* wide range of external noise sources.
*
* Use CAPSENSE&trade; for:
* * Touch and gesture detection for various interfaces
* * Proximity detection for innovative user experiences and low power
*   optimization
* * Contactless liquid-level sensing in a variety of applications
* * Touch-free operations in hazardous materials
*
********************************************************************************
* \section section_capsense_general General Description
********************************************************************************
*
* The CAPSENSE&trade; middleware Library supports operation with fourth-generation,
* fifth-generation and fifth-generation low power of CAPSENSE&trade; HW.
* CAPSENSE&trade; HW enables the multiple sensing
* capabilities on PSOC&trade; devices including the Self-Capacitance (CSD) and Mutual-Capacitance (CSX)
* capacitive touch sensing solutions, inductive sensing (ISX), impedance measurement, and
* other features.
*
* Middleware access available the CAPSENSE&trade; HW block through the corresponding
* peripheral Driver:
*  - CSD (CAPSENSE&trade; Sigma-Delta) driver for the forth-generation of the
*    CAPSENSE&trade; HW;
*  - MSC (Multi-Sensor Converter) driver for the fifth-generation of the
*    CAPSENSE&trade; HW;
*  - MSCLP (Multi-Sensor Converter Low Power) driver for the fifth-generation of the
*    CAPSENSE&trade; HW;
*
* The CAPSENSE&trade; peripheral driver does not provide any system-level functions.
* It only implements the interface to the CAPSENSE&trade; HW resource.
*
* The supported CAPSENSE&trade; HW blocks can perform only one function at a time.
* However, all supported functionality (like CAPSENSE&trade;, CSDADC, etc.) can be
* time-multiplexed in a design. I.e. you can save the existing state of
* the CAPSENSE&trade; middleware, restore the state of the CSDADC middleware, perform
* CSDADC measurements, and then switch back to the CAPSENSE&trade; functionality.
* For details and code examples, refer to the description of the
* Cy_CapSense_Save() and Cy_CapSense_Restore() functions.
*
* \image html CAPSENSE_SOLUTION_MSCLP.png "CAPSENSE&trade; Solution" width=800px
* \image latex CAPSENSE_SOLUTION_MSCLP.png
*
* This section describes only the CAPSENSE&trade; middleware. Refer to the corresponding
* sections of documentation for other middleware supported by the CAPSENSE&trade; HW.
*
* A CAPSENSE&trade; solution includes:
* * The CAPSENSE&trade; Configurator tool to create
*   and configure CAPSENSE&trade; widgets. It can be launched in ModusToolbox&trade;
*   from the CAPSENSE&trade; superblock personality and in Stand-alone mode.
*   It contains a separate document about how to create and
*   configure widgets, parameters and algorithm descriptions.
* * API to control the design from the application program. This documentation
*   describes API with code snippets of how to use them.
* * The CAPSENSE&trade; Tuner tool for real-time tuning, testing, and debugging,
*   for easy and smooth designing of human interfaces on customer products.
*   The Tuner tool communicates with a device through a HW bridge and
*   communication drivers (EzI2C, UART, etc.) and allows to monitor
*   widget statuses, sensor signals, detected touch positions, gestures, etc.
* The application program does not need to interact with the CSD driver
* and/or other drivers such as GPIO, SysClk directly. All of that is
* configured and managed by middleware.
*
* Include cy_capsense.h to get access to all functions and other declarations
* in this library. If you are using the ModusToolbox&trade; CAPSENSE&trade; Configurator tool,
* you can include cycfg_capsense.h only.
*
* \subsection subsection_capsense_features Features
*
* * Offers best-in-class signal-to-noise ratio (SNR)
* * Supports Self-Capacitance (CSD) and Mutual-Capacitance (CSX) sensing methods
* * Inductive sensing method (ISX) available for fifth-generation low power CAPSENSE&trade;
* * Liquid Level widget is available for the fifth-generation low power CAPSENSE&trade;
* * Fifth-generation low power CAPSENSE&trade; supports autonomous scanning in Deep Sleep
*   power mode
* * Supports various Widgets, such as Buttons, Matrix Buttons, Sliders,
*   Touchpads, and Proximity Sensors
* * Provides ultra-low power consumption capacitive
*   sensing technology
* * Contains the integrated graphical CAPSENSE&trade; Tuner tool for real-time tuning,
*   testing, and debugging
* * Provides superior immunity against external noise and low-radiated
*   emission
* * Offers best-in-class liquid tolerance
* * Supports one-finger and two-finger gestures
*
********************************************************************************
* \section group_capsense_quick_start Quick Start Guide
********************************************************************************
*
* The quickest way to get started with CAPSENSE&trade; is using code examples.
* Infineon Technologies continuously extends their portfolio of code examples
* at the <a href="http:/\/www.infineon.com"><b>Infineon Technologies</b></a>
* and at the <a href="https:/\/github.com/Infineon">
* <b> Infineon Technologies GitHub</b></a>. The following are the links
* to code examples for different PSOC&trade; families presented on GitHub.
*
* \subsection group_capsense_quick_start_psoc4_csd_ces Code Examples for PSOC&trade; 4 Devices with fourth-generation CAPSENSE&trade;
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-capsense-csd-button-tuning">
*   <b>CSD Button Manual Tuning</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-capsense-csx-button-tuning">
*   <b>CSX Button Manual Tuning</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-capsense-csd-slider-tuning">
*   <b>CSD Slider Manual Tuning</b></a>
*
* \subsection group_capsense_quick_start_psoc4_msc_ces Code Examples for PSOC&trade; 4 Devices with fifth-generation CAPSENSE&trade;
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-msc-capsense-csd-button-tuning">
*   <b>CSD Button Manual Tuning</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-msc-capsense-csx-button-tuning">
*   <b>CSX Button Manual Tuning</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-msc-capsense-csd-slider-tuning">
*   <b>CSD Slider Manual Tuning</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-msc-capsense-csd-touchpad-tuning">
*   <b>CSD Touchpad Manual Tuning</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-msc-capsense-csx-touchpad-tuning">
*   <b>CSX Touchpad Manual Tuning</b></a>
*
* \subsection group_capsense_quick_start_psoc4_msclp_ces Code Examples for PSOC&trade; 4 Devices with fifth-generation low power CAPSENSE&trade;
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-msclp-capsense-low-power">
*   <b>MSCLP CAPSENSE&trade; low power</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-msclp-low-power-csd-button">
*   <b>MSCLP low-power self-capacitance button</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-msclp-low-power-csx-slider">
*   <b>MSCLP low-power mutual-capacitance slider</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-msclp-liquid-tolerant-proximity">
*   <b>MSCLP CAPSENSE&trade; liquid-tolerant proximity-sensing</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc4-msclp-csx-touchpad">
*   <b>MSCLP multitouch mutual-capacitance touchpad tuning</b></a>
*
* \subsection group_capsense_quick_start_psoc6_csd_ces Code Examples for PSOC&trade; 6 Devices with fourth-generation CAPSENSE&trade;
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc6-capsense-buttons-slider">
*   <b>Two Buttons and Slider with CAPSENSE&trade; Tuner</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc6-low-power-capsense-freertos">
*   <b>low power Slider and Ganged Sensors with FreeRTOS</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc6-capsense-custom-scan">
*   <b>Custom Scan</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc6-ble-capsense-tuner-client">
*   <b>BLE Client for CAPSENSE&trade; Tuning</b></a>
*
* * <a href="https:/\/github.com/Infineon/mtb-example-psoc6-ble-capsense-tuner-server">
*   <b>BLE Server for CAPSENSE&trade; Tuning</b></a>
*
* The CAPSENSE&trade; middleware can be used in various development environments
* such as ModusToolbox&trade;, MBED, etc. Refer to the \ref section_capsense_toolchain.
* The following are the configuration considerations for the different environments.
*
* \subsection group_capsense_quick_start_modus ModusToolbox&trade; Configuration Considerations
*
* This quick start guide assumes that the environment is configured:
* * The <a href="https:/\/github.com/Infineon/mtb-pdl-cat1">
* <b>CAT1 Peripheral Driver Library (PDL)</b></a> is included in the project
* in case if the PSOC&trade; 6 device is used.
* * The <a href="https:/\/github.com/Infineon/mtb-pdl-cat2">
* <b>CAT2 Peripheral Driver Library (PDL)</b></a> is included in the project
* in case if the PSOC&trade; 4 device is used.
* * <a href="https:/\/www.infineon.com/ModusToolboxDeviceConfig">
* <b>ModusToolbox&trade; Device Configurator Tool</b></a>,
* <a href="https:/\/www.infineon.com/ModusToolboxCapSenseConfig">
* <b>ModusToolbox&trade; CAPSENSE&trade; Configurator Tool</b></a>, and
* <a href="https:/\/www.infineon.com/ModusToolboxCapSenseTuner">
* <b>ModusToolbox&trade; CAPSENSE&trade; Tuner Tool</b></a>
* are installed on the machine.
*
* \note
* Ensure to set up the device power voltages correctly
* to the proper operation of the device power domains. The Setup is
* on the System Tab of the Device Configurator tool. Enable the Power check box
* and set up the voltages as they are red-outlined in the picture below.
*
* \image html check_power.png "Power Setup" width=800px
* \image latex check_power.png
*
* \subsection group_capsense_quick_start_mbed MBED OS Configuration Considerations
*
* You can immediately start with the following MBED OS code example available
* at the <a href="https:/\/github.com/Infineon/">
* <b> Infineon GitHub</b></a>:
* * <a href="https:/\/github.com/Infineon/mbed-os-example-capsense">
*   <b>CAPSENSE&trade; buttons and slider for PSOC&trade; 6 MCU with Mbed OS</b></a>
*
* If you are doing your own project, remember to include cycfg.h file:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_Resource_Include
*
* and call the resource initialization functions in main() at the beginning:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_Resource_Initialization
*
********************************************************************************
* \section section_capsense_configuration Summary of Application Programming Interface (API)
********************************************************************************
*
* The CAPSENSE&trade; middleware operates on the top of the MSCLP/MSC/CSD HW driver.
* Refer to the PDL API Reference Manual.
*
* This document provides descriptions of the functions in the CAPSENSE&trade;
* middleware library, and descriptions of the data structures (register map)
* used by the middleware library.
*
* The Application Programming Interface (API) routines allow controlling and
* executing specific tasks using the CAPSENSE&trade; middleware. The CAPSENSE&trade; API
* is described in the following sections:
* * \ref group_capsense_high_level
* * \ref group_capsense_low_level
* * \ref group_capsense_data_structure
* * \ref group_capsense_enums
* * \ref group_capsense_macros
* * \ref group_capsense_callbacks
*
********************************************************************************
* \section section_capsense_toolchain Supported Software and Tools
********************************************************************************
*
* This version of the CAPSENSE&trade; middleware was validated for compatibility
* with the following Software and Tools:
* <table class="doxtable">
*   <tr>
*     <th>Software and Tools</th>
*     <th>Version</th>
*   </tr>
*   <tr>
*     <td>ModusToolbox&trade; Software Environment</td>
*     <td>3.7.0</td>
*   </tr>
*   <tr>
*     <td>- ModusToolbox&trade; Device Configurator tool</td>
*     <td>5.50</td>
*   </tr>
*   <tr>
*     <td>- ModusToolbox&trade; MSC Superblock Personality for PSOC&trade; 4 devices in the Device Configurator tool</td>
*     <td>1.0</td>
*   </tr>
*   <tr>
*     <td>- ModusToolbox&trade; MSCLP Personality for PSOC&trade; 4 devices in the Device Configurator tool</td>
*     <td>3.0</td>
*   </tr>
*   <tr>
*     <td>- ModusToolbox&trade; MSC Personality for PSOC&trade; 4 devices in the Device Configurator tool</td>
*     <td>1.1</td>
*   </tr>
*   <tr>
*     <td>- ModusToolbox&trade; CSD Personality for PSOC&trade; 4 devices in the Device Configurator tool</td>
*     <td>2.0</td>
*   </tr>
*   <tr>
*     <td>- ModusToolbox&trade; CSD Personality for PSOC&trade; 6 devices in the Device Configurator tool</td>
*     <td>3.0</td>
*   </tr>
*   <tr>
*     <td>- ModusToolbox&trade; CAPSENSE&trade; Configurator tool</td>
*     <td>11.0.0</td>
*   </tr>
*   <tr>
*     <td>- ModusToolbox&trade; CAPSENSE&trade; Tuner tool</td>
*     <td>11.0.0</td>
*   </tr>
*   <tr>
*     <td>CAT1 Peripheral Driver Library (PDL)</td>
*     <td>3.22.0</td>
*   </tr>
*   <tr>
*     <td>CAT2 Peripheral Driver Library (PDL)</td>
*     <td>2.21.0</td>
*   </tr>
*   <tr>
*     <td>GCC Compiler</td>
*     <td>14.2</td>
*   </tr>
*   <tr>
*     <td>IAR Compiler</td>
*     <td>9.50.2</td>
*   </tr>
*   <tr>
*     <td>Arm Compiler 6 <sup><b>(Note 1)</b></sup></td>
*     <td>6.22.0</td>
*   </tr>
*   <tr>
*     <td>MBED OS (only for PSOC&trade; 6)</td>
*     <td>5.15.8</td>
*   </tr>
* </table>
*
* \note
* The CAPSENSE&trade; middleware includes the pre-compiled libraries for
* Arm Compiler 6. They are built with the following options to be compatible
* with ModusToolbox&trade; and MBED:
* * -fshort-enums - Set the size of an enumeration type to the smallest
*                   data type that can hold all enumerator values
* * -fshort-wchar - Set the size of wchar_t to 2 bytes
* \note
* To operate in custom environments with Arm Compiler 6, apply
* the above mentioned build options.
*
********************************************************************************
* \section section_capsense_update Update to Newer Versions
********************************************************************************
* Refer to the \ref section_capsense_changelog to learn about the design impact
* of the newer version. Set up your environment in accordance with
* \ref section_capsense_toolchain.
*
* Ensure:
* * The specified version of the ModusToolbox&trade; Device Configurator tool and
*   the Personality are used to re-generate the device configuration.
* * The specified version of the ModusToolbox&trade; CAPSENSE&trade; Configurator tool is used
*   to re-generate the middleware configuration.
* * The toolchains are set up properly for your environment per the settings
*   outlined in the Supported Software and Tools.
* * The project is re-built once the toolchains are configured and the
*   configuration is completed.
*
* You might need to re-generate the configuration structures for either the
* device initialization code or the middleware initialization code.
* * Launch the ModusToolbox&trade; Device Configurator tool and perform the File->Save command
*   to re-generate the device initialization code.
* * From the ModusToolbox&trade; Device Configurator tool, launch the
*   ModusToolbox&trade; CAPSENSE&trade; Configurator tool and perform the File->Save command to
*   re-generate the middleware initialization code.
*
********************************************************************************
* \section section_capsense_memory_usage Memory Usage
********************************************************************************
*
* The CAPSENSE&trade; middleware Flash and RAM memory consumption varies:
* * marginally - depending on the compiler and device
* * significantly - depending on the project CAPSENSE&trade; configuration and
*   number of APIs called by the application program.
*
* The table below provides the middleware total memory consumption for
* specific CAPSENSE&trade; configurations. Memory consumption for any custom
* design/configuration can be determined by analyzing a *.map file
* generated by the compiler.
*
* The measurements were done with GCC compiler configured in
* the Release mode with optimization set for Size.
*
* <table class="doxtable">
*  <tr><th>Configuration:</th><th>Mode</th><th>Sensor Connection Type</th><th>Memory Type</th><th>Configuration 1</th><th>Configuration 2</th><th>Configuration 3</th><th>Configuration 4</th><th>Configuration 5</th><th>Configuration 6</th><th>Configuration 7</th><th>Configuration 8</th><th>Configuration 9</th></tr>
*  <tr align="center"><td rowspan=2>4th Gen</td><td rowspan=2>IntDrv</td><td rowspan=2>AMUX</td><td>Flash:</td><td>&lt; 6.1 kB</td><td>&lt; 8.7 kB</td><td>&lt; 11.8 kB</td><td>&lt; 5.6 kB</td><td>&lt; 6.3 kB</td><td>&lt; 8.0 kB</td><td>&lt; 9.2 kB</td><td>&lt; 9.6 kB</td><td>&lt; 19.2 kB</td></tr>
*  <tr align="center"><td>SRAM:</td><td>&lt; 0.6 kB</td><td>&lt; 0.8 kB</td><td>&lt; 0.9 kB</td><td>&lt; 0.8 kB</td><td>&lt; 0.8 kB</td><td>&lt; 1.1 kB</td><td>&lt; 1.8 kB</td><td>&lt; 0.7 kB</td><td>&lt; 2.5 kB</td></tr>
*  <tr align="center"><td rowspan=6>5th Gen</td><td rowspan=4>IntDrv</td><td rowspan=2>AMUX</td><td>Flash:</td><td>&lt; 8.2 kB</td><td>&lt; 11.0 kB</td><td>&lt; 12.4 kB</td><td>&lt; 8.2 kB</td><td>&lt; 9.6 kB</td><td>&lt; 10.7 kB</td><td>&lt; 11.8 kB</td><td>&lt; 12.6 kB</td><td>&lt; 16.3 kB</td></tr>
*  <tr align="center"><td>SRAM:</td><td>&lt; 1.1 kB</td><td>&lt; 1.2 kB</td><td>&lt; 1.3 kB</td><td>&lt; 1.3 kB</td><td>&lt; 1.3 kB</td><td>&lt; 1.7 kB</td><td>&lt; 2.3 kB</td><td>&lt; 1.7 kB</td><td>&lt; 3.3 kB</td></tr>
*  <tr align="center"><td rowspan=2>CTRL_MUX</td><td>Flash:</td><td>&lt; 7.9 kB</td><td>&lt; 10.9 kB</td><td>&lt; 12.0 kB</td><td>&lt; 7.8 kB</td><td>&lt; 9.7 kB</td><td>&lt; 10.3 kB</td><td>&lt; 11.4 kB</td><td>&lt; 12.4 kB</td><td>&lt; 16.0 kB</td></tr>
*  <tr align="center"><td>SRAM:</td><td>&lt; 1.3 kB</td><td>&lt; 1.5 kB</td><td>&lt; 1.5 kB</td><td>&lt; 1.2 kB</td><td>&lt; 1.2 kB</td><td>&lt; 2.6 kB</td><td>&lt; 3.3 kB</td><td>&lt; 2.1 kB</td><td>&lt; 5.4 kB</td></tr>
*  <tr align="center"><td rowspan=2>DMA</td><td rowspan=2>CTRL_MUX</td><td>Flash:</td><td>&lt; 8.7 kB</td><td>&lt; 11.7 kB</td><td>&lt; 13.0 kB</td><td>&lt; 8.6 kB</td><td>&lt; 10.4 kB</td><td>&lt; 11.0 kB</td><td>&lt; 12.1 kB</td><td>&lt; 13.1 kB</td><td>&lt; 16.7 kB</td></tr>
*  <tr align="center"><td>SRAM:</td><td>&lt; 1.3 kB</td><td>&lt; 1.5 kB</td><td>&lt; 1.5 kB</td><td>&lt; 2.2 kB</td><td>&lt; 2.2 kB</td><td>&lt; 2.6 kB</td><td>&lt; 3.3 kB</td><td>&lt; 2.1 kB</td><td>&lt; 5.4 kB</td></tr>
*  <tr align="center"><td rowspan=2>5th Gen Low Power</td><td rowspan=2>LP-AOS</td><td rowspan=2>AMUX</td><td>Flash:</td><td>&lt; 7.9 kB</td><td>&lt; 11.8 kB</td><td>&lt; 12.9 kB</td><td>&lt; 7.7 kB</td><td>&lt; 10.1 kB</td><td>&lt; 10.2 kB</td><td>&lt; 11.6 kB</td><td>&lt; 12.2 kB</td><td>&lt; 15.8 kB</td></tr>
*  <tr align="center"><td>SRAM:</td><td>&lt; 1.2 kB</td><td>&lt; 1.4 kB</td><td>&lt; 1.5 kB</td><td>&lt; 2.1 kB</td><td>&lt; 2.1 kB</td><td>&lt; 2.5 kB</td><td>&lt; 3.2 kB</td><td>&lt; 1.5 kB</td><td>&lt; 4.8 kB</td></tr>
*  <tr><th colspan=13>Widgets</th></tr>
*  <tr><td colspan=4>CSD Button</td><td>3(10 sensors)</td><td>3(10 sensors)</td><td>3(10 sensors)</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>1(1 sensor)</td><td>1(1 sensor)</td></tr>
*  <tr><td colspan=4>CSD Matrix Buttons</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>CSD Slider</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>CSD Touchpad</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>1(8x8)</td><td>1(8x8)</td></tr>
*  <tr><td colspan=4>CSD Proximity</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>CSX Button</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
