zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense.h
*  <tr><td colspan=4>CSX Matrix Buttons</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>1(4x8)</td><td>1(4x8)</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>CSX Touchpad</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>1(9x4)</td><td>1(9x4)</td><td>&nbsp;</td><td>1(8x8)</td></tr>
*  <tr><th colspan=13>Features</th></tr>
*  <tr><td colspan=4>Gesture</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>Ballistic Multiplier</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>Centroid Type</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>Supported fingers on touchpad</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>Shield</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>enabled</td></tr>
*  <tr><td colspan=4>SmartSense</td><td>&nbsp;</td><td>enabled</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>CSD auto-calibration</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>CSX auto-calibration</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>Self-test</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><th colspan=13>Raw Count Filters</th></tr>
*  <tr><td colspan=4>IIR</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>enabled</td><td>enabled</td></tr>
*  <tr><td colspan=4>Median</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>Average</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><th colspan=13>Position Filters</th></tr>
*  <tr><td colspan=4>IIR</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>Median</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>Average</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>Adaptive IIR</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>&nbsp;</td><td>&nbsp;</td></tr>
*  <tr><td colspan=4>Jitter</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td><td>enabled</td><td>&nbsp;</td><td>&nbsp;</td></tr>
* </table>
*
* \note
* Configuration considerations:
* * To select values for the Scan mode and Sensor connection method parameters (for the fifth-generation of the CAPSENSE&trade; HW)
* navigate to the Advanced tab in the CAPSENSE&trade; Configurator tool, and then select the General settings sub-tab.
*
* * For the forth-generation of the CAPSENSE&trade; HW, the IntDrv mode with the AMUX sensor connection type is available only.
*
********************************************************************************
* \section section_capsense_misra MISRA-C:2012 Compliance
********************************************************************************
*
* This page describes MISRA-C:2012 compliance and deviations for
* the CAPSENSE&trade; middleware.
*
* MISRA stands for Motor Industry Software Reliability Association. The MISRA
* specification covers a set of 10 mandatory rules, 110 required rules and
* 39 advisory rules that apply to firmware design and has been put together
* by the Automotive Industry to enhance the quality and robustness of
* the firmware code embedded in automotive devices.
*
* \subsection subsection_capsense_misra-mw CAPSENSE&trade; Middleware Deviation
*
* <table class="doxtable">
*   <tr>
*     <th>Rule ID</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*    <tr>
*     <td>Directive  4.8</td>
*     <td>If a pointer to a structure or union is never dereferenced within a translation
*         unit, then the implementation of the object should be hidden.
*     </td>
*     <td>Advisory. The middleware library consists of several modules. One of them
*         is CapSense Data Structure. All communication between the other modules
*         is performed through CapSense Data Structure.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 2.3</td>
*     <td>A project should not contain unused type declarations.
*     </td>
*     <td>Advisory. The middleware library provides API to the hardware. The type
*         is part of API, which is defined for application-level only.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 2.5</td>
*     <td>A project should not contain unused macro declarations.
*     </td>
*     <td>Advisory. The middleware library provides API to the hardware. The macro
*         is part of API, which is defined for application-level only.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 5.1</td>
*     <td>External identifiers shall be distinct.
*     </td>
*     <td>Toolchains from Supported Software and Tools documentation section
*         are verified to work with functions, names of which have similar first 31 symbols.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 5.4</td>
*     <td>Macro identifiers shall be distinct.
*     </td>
*     <td>Toolchains from Supported Software and Tools documentation section
*         are verified to work with macros, names of which have similar first 31 symbols.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 5.6</td>
*     <td>A typedef name shall be a unique identifier.
*     </td>
*     <td>During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All typedef names are unique for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 5.8</td>
*     <td>Identifiers that define objects or functions with external linkage shall be unique.
*     </td>
*     <td>During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 5.9</td>
*     <td>Identifiers that define objects or functions with internal linkage should be unique.
*     </td>
*     <td>Advisory. During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 8.3</td>
*     <td>All declarations of an object or function shall use the same names and type qualifiers.
*     </td>
*     <td>During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 8.5</td>
*     <td>An external object or function shall be declared once in one and only one file.
*     </td>
*     <td>During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 8.6</td>
*     <td>An identifier with external linkage shall have exactly one external definition.
*     </td>
*     <td>During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 8.7</td>
*     <td>Functions and objects should not be defined with external linkage if they
*         are referenced in only one translation unit.
*     </td>
*     <td>Advisory. During the code analysis, the same source files are compiled multiple times
*         with device-specific options. All object and function identifiers are unique
*         for each specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 8.13</td>
*     <td>A pointer should point to const-qualified type whenever possible.
*     </td>
*     <td>Advisory. During the code analysis, the same source files are compiled multiple times
*         with device-specific options. A function argument can be const for some specific run.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 11.4</td>
*     <td>A conversion should not be performed between a pointer to object and an integer type.
*     </td>
*     <td>Advisory. There is an issue with a SYSCLK driver (IFXID-10550), due to which integer type
*          is cast to an object pointer type. Code is manually checked and reviewed to be safe.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 11.5</td>
*     <td>A conversion should not be performed from pointer to void into pointer to object.
*     </td>
*     <td>Advisory. The cast from void pointer to an object pointer does not have any unintended effect,
*         as it is a consequence of the definition of a structure based on function pointers.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 14.2</td>
*     <td>A for loop shall be well-formed.
*     </td>
*     <td>The third clause of the for loop is empty to improve execution time.
*     </td>
*   </tr>
*    <tr>
*     <td>Rule 18.4</td>
*     <td>The +, -, += and -= operators should not be applied to an expression of pointer type.
*     </td>
*     <td>Advisory. There are several instances of pointer arithmetic in drivers. They cannot be avoided,
*         so are manually checked and reviewed to be safe.
*     </td>
*   </tr>
* </table>
*
* \subsection subsection_capsense_misra-cfg CAPSENSE&trade; Configurator Tool Generated Sources Deviation
*
* <table class="doxtable">
*   <tr>
*     <th>Rule ID</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>Rule 3.1</td>
*     <td>The character sequences / * and / / shall not be used within a comment.</td>
*     <td>Using of the special comment symbols is need for Doxygen comment
*         support, it does not have any impact on functionality. </td>
*   </tr>
*   <tr>
*     <td>Rule 8.4</td>
*     <td>A compatible declaration shall be visible when an object or function with external linkage is defined.</td>
*     <td>The CAPSENSE&trade; middleware library consists of several modules. One of them is CAPSENSE&trade; Built-in Self Test (BIST).
*         All the BIST variables are used in other data structures and accessed using pointers.</td>
*   </tr>
*   <tr>
*     <td>Rule 11.4</td>
*     <td>A conversion should not be performed between a pointer to object and an integer type.</td>
*     <td>Advisory. There are several instances of pointer conversions in Generated Source.
*         They are manually checked and reviewed to be safe.</td>
*   </tr>
* </table>
*
********************************************************************************
* \section section_capsense_errata Errata
********************************************************************************
*
* This section lists the known problems with the CAPSENSE&trade; middleware.
*
* <table class="doxtable">
*   <tr><th>ID</th><th>Known Issue</th><th>Workaround</th></tr>
*   <tr>
*     <td>319100</td>
*     <td>
*         GPIO simultaneous operation with unrestricted strength and frequency
*         creates noise that can affect CAPSENSE&trade; operation. This issue
*         is applicable for the fourth CAPSENSE&trade; generation devices.
*     </td>
*     <td>
*         For detail, refer to the errata section of the device datasheet.
*     </td>
*   </tr>
*   <tr>
*     <td>3159</td>
*     <td>
*         Scanning a sensor with low capacitance (about 8pF and less) with low
*         frequency (around 300kHz and less) might lead to raw count variation
*         from scan to scan. This issue is applicable for the fourth CAPSENSE&trade;
*         generation devices.
*     </td>
*     <td>
*         There are several possible workarounds:
*         1. Increase the Scan resolution.
*         2. Increase the Sense clock frequency. For the best results, perform
*            scanning with as high as possible Sense clock frequency.
*         3. If shield is required for a design, enable the shield tank (Csh)
*            capacitor.
*         4. Increase the sensor capacitance by changing its layout or introduce
*            extra capacitor between the sensor pin and ground.
*         5. Increase number of Fine initialization cycles. Open the cycfg_capsense.c
*            file and modify the .csdFineInitTime field of the cy_capsense_commonConfig
*            structure.
*         6. Increase the CSD init switch resistance. Open the cycfg_capsense.c file
*            and update the .csdInitSwRes field of the cy_capsense_commonConfig structure
*            with the CY_CAPSENSE_INIT_SW_RES_HIGH value.
*     </td>
*   </tr>
*   <tr>
*     <td>17158</td>
*     <td>
*         ISX scan followed by BIST measurement or with other sensing methods
*         CSD & CSX introduces drift in raw count. This impacts the
*         performance and accuracy of the ISX scanning.
*     </td>
*     <td>
*         There are several possible workarounds:
*         1. Use ISX in standalone mode (without other sensing methods)
*         2. Use ISX without built-in self-test (BIST)
*         3. Configure Inactive sensor connection parameter to High-Z
*         4. Introduce a dummy scan before ISX.
*     </td>
*   </tr>
*   <tr>
*     <td>19716</td>
*     <td>
*         Device Configurator and CAPSENSE&trade; Configurator allow assigning Cmod 
*         capacitors to wrong port-pins for fifth-generation CAPSENSE&trade; and 
*         fifth-generation low power CAPSENSE&trade; All Cmod capacitors have fixed pre-defined HW location.
*     </td>
*     <td>
*         Refer to a device datasheet to get the proper Cmod capacitors assignment for a desired device.
*     </td>
*   </tr>
*   <tr>
*     <td>20083</td>
*     <td>
*         CAPSENSE™ middleware has the Beta Version of the Liquid Level sensing feature, 
*         which might have an impact on the performance.
*     </td>
*     <td>
*         There is no workaround. This will be addressed in a future update.
*     </td>
*   </tr>
*   <tr>
*     <td>20238</td>
*     <td>
*         Under specific foam conditions near the sensors, when the foam is disturbed, 
*         differentiation between the liquid reference line and the foam level may be reduced.
*     </td>
*     <td>
*         There is no workaround. This will be addressed in a future update.
*     </td>
*   </tr>
* </table>
*
* \note Refer to the "Errata" section of the device datasheet to get information
* about the known problems related to the CAPSENSE&trade; HW IP block.
*
********************************************************************************
* \section section_capsense_changelog Changelog
********************************************************************************
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td rowspan="6">10.0.0</td>
*     <td colspan="2"><i><b>
*       This version is compatible with v9.0.0,
*       but due to switching to MTB 3.7, new Device-DB, PDL, etc.
*       a migration of projects created with a past version might be
*       not possible. In this case a project should be newly created.
*       Also, if you use the CAPSENSE&trade; middleware v10.0.0, you must use
*       the CAPSENSE&trade; Configurator v11.0.0 or later. This MW version
*       is not compatible with the previous CAPSENSE&trade; Configurator versions.
*     </b></i>
*   </tr>
*   <tr>
*     <td> 
*         Added LLW multi-point presence/absence detection.
*     </td>
*     <td>
*         New feature support.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Expanded slider widget functionality. Added 5x5 centroid calculation,
*         fat finger detection, palm rejection, etc.
*     </td>
*     <td>
*         New feature support.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Added advanced low-pass (ALP) filter.
*     </td>
*     <td>
*         New feature support.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Improved the algorithm for the 4- and more segment Liquid Level widget.
*     </td>
*     <td>
*         Improved functionality.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Changed the Cy_CapSense_IsTankRemoved() function prototype:
*         replaced the widget context pointer argument with widgetId
*         and CAPSENSE&trade; context pointer for API uniformity.
*     </td>
*     <td>
*         API uniformity improvement.
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="3">9.10.0</td>
*     <td colspan="2"><i><b>
*       This version is compatible with v9.0.0.
*       Also, if you use the CAPSENSE&trade; middleware v9.10.0, you must use
*       the CAPSENSE&trade; Configurator v10.10.0 or later.
*     </b></i>
*   </tr>
*   <tr>
*     <td> 
*         Added support of Liquid Level Foam Rejection feature.
*     </td>
*     <td>
*         New feature support.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Fixed MISRA violations 10.8 and 17.8.
*     </td>
*     <td>
*         Defect fixing.
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="8">9.0.0</td>
*     <td colspan="2"><i><b>
*       This version is compatible with v8.10.0,
*       but due to switching to MTB 3.7, new Device-DB, PDL, etc.
*       a migration of projects created with a past version might be
*       not possible. In this case a project should be newly created.
*       Also, if you use the CAPSENSE&trade; middleware v9.0.0, you must use
*       the CAPSENSE&trade; Configurator v10.0.0 or later. This MW version
*       is not compatible with the previous CAPSENSE&trade; Configurator versions.
*     </b></i>
*   </tr>
*   <tr>
*     <td> 
*         New widget Liquid Presence
*     </td>
*     <td>
*         New feature support.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         New feature Liquid tank removal detection
*     </td>
*     <td>
*         New feature support.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*      Five new gestures:
*         * Two-finger long press
*         * Two-finger double click
*         * Two-finger flick
*         * Two-finger edge swipe
*         * One-finger triple click
*     </td>
*     <td>
*         New feature support.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Improved the algorithm for the 3-segment Liquid Level widget.
*     </td>
*     <td>
*         Improved functionality.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Fixed broken links in documentation
*     </td>
*     <td>
*         Defect fixing.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Fixed clock source selection in SMARTSENSE for multiple widgets
*     </td>
*     <td>
*         Defect fixing.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Fixed Cmod pin assignment for the fifth-generation CAPSENSE&trade; in SMARTSENSE:
*         * PSOC&trade; 4100S Max devices
*         * PSOC&trade; high-voltage (HV) mixed signal (MS) devices
*     </td>
*     <td>
*         Defect fixing.
*     </td>
*   </tr>
*   <tr>
*     <td>8.10.0</td>
*     <td> 
*         Fixed defect inside Cy_CapSense_IsLlwCalibrationValid function.
*     </td>
*     <td>
*         Defect fixing.
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="6">8.0.0</td>
*     <td colspan="2"><i><b>
*       This version is compatible to the v7.0.0,
*       but due to switching to MTB 3.6, new Device-DB, PDL, etc.
*       a migration of projects created with past version might be
*       not possible. In this case a project should be newly created.
*       Also, if you use the CAPSENSE&trade; middleware v8.0.0, you must use
*       the CAPSENSE&trade; Configurator v9.0.0 tool or later. This MW version
*       is not compatible with the previous Configurator tool versions.
*     </b></i>
*   </tr>
*   <tr>
*     <td> 
*         Added support of Enable/Disable Auto calibration from application level.
*     </td>
*     <td>
*         New feature support, improved manufacturing tolerance.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Added support of LLS with three electrodes.
*     </td>
*     <td>
*         New feature support.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Added LLS Linearity Improvement feature.
*     </td>
*     <td>
*         New feature support, improved manufacturing tolerance.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Added WBX Rawcount Correction.
*     </td>
*     <td>
*         New feature support, improved manufacturing tolerance.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*         Added supporting of CDS/CSX touchpad 2x2 and 2 electrodes linear slider.
*     </td>
*     <td>
*         New feature support.
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="9">7.0.0</td>
*     <td colspan="2"><i><b>
*       This version is compatible to the v6.10.0,
*       but due to switching to MTB 3.5, new Device-DB, PDL, etc.
*       a migration of projects created with past version might be
*       not possible. In this case a project should be newly created.
*       Also, if you use the CAPSENSE&trade; middleware v7.0.0, you must use
*       the CAPSENSE&trade; Configurator v8.0.0 tool or later. This MW version
*       is not compatible with the previous Configurator tool versions.
*     </b></i>
*   </tr>
*   <tr>
*     <td> Added support of PSOC&trade; 4100T Plus device family.
*     </td>
*     <td>
*         New device support.
*     </td>
*   </tr>
*   <tr>
*     <td> Added scaling to CDAC codes in the manual mode for the CSD sensing
*       method by using trim registers.
*     </td>
*     <td>
*         New feature support, improved manufacturing tolerance.
*     </td>
*   </tr>
*   <tr>
*     <td> Added scaling to measured sensor, electrode and shield capacitances
*       in built-in self-test library.
*     </td>
*     <td>
*         New feature support, improved manufacturing tolerance.
*     </td>
*   </tr>
*   <tr>
*     <td> Redefined CDAC LSB from 8.86fF to 8.87fF.
*     </td>
*     <td>
*         Improved accuracy.
*     </td>
*   </tr>
*   <tr>
*     <td> Fixed Shield electrode capacitance measurement inside built-in self-test
*       library. Wrong measurement happens when the first sensor in the configuration
*       does not belong to CSD sensing method.
*     </td>
*     <td>
*         Defect fixing.
*     </td>
*   </tr>
*   <tr>
*     <td> Removed intermediate verification of CDAC auto-calibration status.
*     </td>
*     <td>
*         Supporting customer specific use cases.
*     </td>
*   </tr>
*   <tr>
*     <td> Fixed CDAC auto-calibration corner case when auto and manual modes are combined for the fifth-generation low power CAPSENSE&trade;.
*     </td>
*     <td>
*         Defect fixing.
*     </td>
*   </tr>
*   <tr>
