zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense.h
*     <td> Fixed HW configuration for inactive sensor connection set to active shield in built-in self-test library for sensor capacitance measurement for fifth-generation CAPSENSE&trade;.
*     </td>
*     <td>
*         Defect fixing.
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="9">6.10.0</td>
*     <td colspan="2"><i><b>
*       This version is compatible to the v5.0, 
*       but due to switching to MTB 3.4, new Device-DB, PDL,
*       compiler versions, etc. a migration of projects created with 
*       past version might be not possible. In this case a project should be newly created.
*       Also, if you use the CAPSENSE&trade; middleware v6.10.0, you must use
*       the CAPSENSE&trade; Configurator v7.10.0 tool or later. This MW version is not
*       compatible with the previous Configurator tool versions.
*     </b></i>
*   </tr>
*   <tr>
*     <td> Added Liquid level sensing method for fifth-generation low power device.
*     </td>
*     <td>
*         Feature enhancement.
*     </td>
*   </tr>
*   </tr>
*   <tr>
*     <td> Added Inductive sensing method for fifth-generation low power device.
*     </td>
*     <td>
*         Feature enhancement.
*     </td>
*   </tr>
*   <tr>
*     <td> Added auto-tuning for Inductive sensing widgets. The ISX auto-tuning
*       feature is at the Beta readiness level. It is not fully validated and
*       might not work as expected. Use it to start working on the ISX tuning.
*     </td>
*     <td>
*         Feature enhancement.
*     </td>
*   </tr>
*   <tr>
*     <td> Added Common mode filter.
*     </td>
*     <td>
*         Feature enhancement.
*     </td>
*   </tr>
*   <tr>
*     <td> Added Multi-pin Selection option for fifth-generation low power device.
*     </td>
*     <td>
*         Feature enhancement.
*     </td>
*   </tr>
*   <tr>
*     <td> 
*       Increased supported sensor capacitance range to 275pF and total 
*       Shield electrode capacitance range to 1160pF (CAPSENSE&trade; fifth-generation low power device).
*     </td>
*     <td>
*         Feature enhancement.
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Fixed some non-functional MISRA violations.
*     </td>
*     <td>
*         Defect fixing.
*     </td>
*   </tr>
*   <tr>
*     <td> Fixed documentation.
*     </td>
*     <td>
*         User experience improvement.
*     </td>
*   </tr>
*   <tr>
*     <td>6.0.0</td>
*     <td colspan="2"><i><b>
*       This release is for internal purpose.
*     </b></i>
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="13">5.0</td>
*     <td colspan="2"><i><b>
*       This version is not backward compatible with the
*       previous version due to re-designed CDAC auto-calibration.
*       We tried to keep the established API, but your design may need to be
*       updated to operate with CAPSENSE&trade; middleware v5.0.
*       Also, if you use the CAPSENSE&trade; middleware v5.0, you must use
*       the CAPSENSE&trade; Configurator v6.20 tool or later. This MW version is not
*       compatible with the previous Configurator tool versions.
*     </b></i>
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Re-designed CDAC auto-calibration algorithm for the fifth-generation
*         LP devices
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Added auto-selection mode of CIC2 decimation rate for the
*         fifth-generation low power devices
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Added auto-selection mode of CDAC Dither scale value for the
*         fifth-generation and fifth-generation low power devices
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Added the HW IIR Filter initialization function
*         Cy_CapSense_ScanInitializeHwIirAllSlots() and
*         Cy_CapSense_ScanInitializeHwIirSlots() for fifth-generation low power devices
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Corrected the low power widget scanning flow by excluding waking up at a
*         signal detection - only the end of the frame interrupt is kept.
*         Condition: multiple low power sensors. This will avoid multiple interrupt
*         generation and in some cases prevent the device from hanging.
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Corrected description of the cy_stc_capsense_position_t structure
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Removed Epilogue cycles from the maximum Raw Counts definition
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Hidden a Multi-phase Self feature for fifth-generation low power devices
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Disabled the External Frame Start in the Cy_CapSense_InitializeMaxRaw()
*         function for the fifth-generation devices
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Corrected description of the BIST measurement function
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Corrected description of the cy_stc_capsense_touch_t structure
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Updated description of the software watchdog time calculation for
*         the fifth-generation devices
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="17" >4.0</td>
*     <td colspan="2"><i><b>
*       This version is not backward compatible with the
*       previous version due to fifth-generation low power devices support
*       implementation and defect fixes.
*       We tried to keep the established API, but your design may need to be
*       updated to operate with CAPSENSE&trade; middleware v4.0.
*     </b></i>
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Added CAPSENSE&trade; fifth-generation low power device support
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Added the Inductive sensing method support (ISX)
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Added the feature of enabling/disabling widgets and built-in
*         self-test working/non-working widgets
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Added Multi-phase Self support for fifth-generation low power devices
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Updated the CIC2 functionality for the fifth-generation devices
*         to be consistent with the fifth-generation low power devices.
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Added saturated scan during CAPSENSE&trade; initialization to measure
*         maximum rawcounts precisely instead of using equations.
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Changed the meaning of bit[2] of the widget status register in the cy_stc_capsense_widget_context_t:
*         logical 1 means the widget is enabled. Replaced CY_CAPSENSE_WD_DISABLE_MASK with
*         CY_CAPSENSE_WD_ENABLE_MASK for consistency
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Swapped the position of bit[0] and bit[1] of the sensor status register in the cy_stc_capsense_sensor_context_t:
*         bit[0] reports the Proximity sensor status, bit[1] - the regular sensor status.
*         Updated values of CY_CAPSENSE_SNS_PROX_STATUS_MASK and CY_CAPSENSE_SNS_TOUCH_STATUS_MASK macros.
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Renamed cy_stc_active_scan_sns_t to cy_stc_capsense_active_scan_sns_t.
*     </td>
*     <td>
*         Following naming convention. Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Renamed cy_stc_msc_channel_config_t to cy_stc_capsense_channel_config_t, updated field names
*     </td>
*     <td>
*         Following naming convention. Updated for consistency between fifth-generation and fifth-generation low power devices
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Renamed Cy_CapSense_ProcessWidgetMptxDeconvolution() to Cy_CapSense_ProcessWidgetMpDeconvolution()
*     </td>
*     <td>
*         Updated function name to better reflect its purpose
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Renamed Cy_CapSense_SetCalibrationTargets() to Cy_CapSense_SetCalibrationTarget(),
*         updated function interface and implementation to cover all sensing methods.
*     </td>
*     <td>
*         Feature enhancement.
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Fixed incorrect shield pins configuration for Cy_CapSense_MeasureCapacitanceSensor()
*         function for fourth-generation devices
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Updater measurement error handling for Cy_CapSense_MeasureCapacitanceShieldElectrode(),
*         Cy_CapSense_MeasureCapacitanceSlotSensors() and Cy_CapSense_MeasureCapacitanceSensorElectrode()
*         functions for fifth-generation devices
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Optimized cy_stc_capsense_common_config_t structure (renamed fields, removed unused fields)
*     </td>
*     <td>
*         User experience improvement
*     </td>
*   </tr>
*   <tr>
*     <td>
*         Added Long Press gesture
*     </td>
*     <td>
*         Feature enhancement
*     </td>
*   </tr>
*   <tr>
*     <td>3.0.1</td>
*     <td>
*       Fixed calls of Cy_DMAC_Descriptor_SetDstAddress() and Cy_DMAC_Descriptor_SetSrcAddress()
*       accordingly to changes in DMAC v1.20 mtb-pdl-cat2 driver.
*     </td>
*     <td>
*         Defect fixing
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="12">3.0</td>
*     <td colspan="2"><i><b>
*       This version is not backward compatible with the
*       previous version due to implemented memory consumption optimization.
*       We tried to keep the established API, but your design may need to be
*       updated to operate with CAPSENSE&trade; middleware v3.0.
*
*       Also, if you use the CAPSENSE&trade; middleware v3.0 version then
*       you must use the CAPSENSE&trade; Configurator v4.0 tool or later.
*       This MW version is not compatible with the previous Configurator tool
*       versions.
*     </b></i></td>
*   </tr>
*   <tr>
*     <td>
*     Added fifth-generation CAPSENSE&trade; device support which includes
*     but not limited:
*     * Scanning mode: DMA and Interrupt Driven
*     * Sensor connection method: Analog mux bus and Control mux bus
*     * Re-designed multi-frequency scan feature
*     * Multi-phase TX feature
*     * Improved signal-to-noise ratio
*     * Improved refresh rate
*     </td>
*     <td>New CAPSENSE&trade; MSC platform covering</td>
*   </tr>
*   <tr>
*     <td colspan="2"><i><b>The following rows show changes related to fourth-generation CAPSENSE&trade;</b></i></td>
*   </tr>
*   <tr>
*     <td>Removed usage of deprecated return error and status codes,
*         cy_status enum was replaced with the cy_capsense_status_t variable</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Removed usage of deprecated types, such as uint32 and uint16</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Changed the default IDAC gain index for the CSX auto-calibration to the configured one</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>The following functions were made obsolete:
*         * Cy_CapSense_CSDConnectSns()
*         * Cy_CapSense_CSDDisconnectSns()
*         * Cy_CapSense_CSXConnectRx()
*         * Cy_CapSense_CSXConnectTx()
*         * Cy_CapSense_CSXDisconnectRx()
*         * Cy_CapSense_CSXDisconnectTx()
*         * Cy_CapSense_CalibrateAllCsdWidgets()
*         * Cy_CapSense_CalibrateAllCsxWidgets()
*     </td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>For fourth-generation CAPSENSE&trade; devices callbacks were moved from ptrCommonContext
*         to ptrInternalContext structure</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>Updated the description of the Cy_CapSense_RunSelfTest() function </td>
*     <td>Documentation defect fixing</td>
*   </tr>
*   <tr>
*     <td>Specified measurement units in the following function descriptions:
*         * Cy_CapSense_MeasureCapacitanceSensor()
*         * Cy_CapSense_MeasureCapacitanceShield()
*         * Cy_CapSense_MeasureCapacitanceCap()
*     </td>
*     <td>Documentation defect fixing</td>
*   <tr>
*     <td>Added call of the Cy_CapSense_Wakeup() function to the registered
*     callback in the Cy_CapSense_DeepSleepCallback() function</td>
*     <td>Improved robustness of a sensing module</td>
*   </tr>
*   <tr>
*     <td>Added a possibility to enable/disable independent features of
*     BIST module</td>
*     <td>Expanded flexibility</td>
*   </tr>
*   <tr>
*     <td rowspan="9">2.10</td>
*     <td>Added Built-in Self-test (BIST) library</td>
*     <td>Support Class B (IEC-60730), safety integrity-level compliant design</td>
*   </tr>
*   <tr>
*     <td>Improved the Csh and Cmod coarse initialization functionality.</td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>Improved the shield performance when Csh is enabled</td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>Fixed Cy_CapSense_ScanExt() operation</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Fixed the bug in the Cy_CapSense_SetPinState() function</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Optimized software watch-dog values used in monitoring CAPSENSE&trade;
*         scanning duration</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>Improved IDAC auto-calibration</td>
*     <td>Operation accuracy increasing</td>
*   </tr>
*   <tr>
*     <td>Added the following functions:
*         * Cy_CapSense_GetParam()
*         * Cy_CapSense_SetParam()
*         * Cy_CapSense_GetCRC()
*     </td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>Changed the type of context argument to const in the following
*         functions:
*         * Cy_CapSense_CSDConnectSns()
*         * Cy_CapSense_CSXConnectRx()
*         * Cy_CapSense_CSXConnectTx()
*         * Cy_CapSense_CSXDisconnectRx()
*         * Cy_CapSense_CSXDisconnectTx()
*         * Cy_CapSense_SetPinState()
*     </td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td rowspan="6">2.0</td>
*     <td>Added memory usage section to the CAPSENSE&trade; API Ref Guide</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>Updated documentation</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>Added the errata section to the CAPSENSE&trade; API Ref Guide</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>CAPSENSE&trade; MW sources are enclosed with the conditional compilation to
*         ensure a successful compilation for non-CAPSENSE&trade;-capable devices</td>
*     <td>Fixing a compilation error for non CAPSENSE&trade;-capable devices</td>
*   </tr>
*   <tr>
*     <td>Optimized flash memory consumption based on user's configuration</td>
*     <td>Flash foot-print optimization</td>
*   </tr>
*   <tr>
*     <td>Renamed function Cy_CapSense_CheckCommandIntegrity() to
*         Cy_CapSense_CheckTunerCmdIntegrity()</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td rowspan="2">1.20</td>
*     <td>Added Arm Compiler 6 support</td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>Changed the hierarchy of the binary files folders</td>
*     <td>MBED OS compatibility</td>
*   </tr>
*   <tr>
*     <td rowspan="6">1.1</td>
*     <td>
*         The following functions made obsolete:
*         * Cy_CapSense_CSDSetupWidget()
*         * Cy_CapSense_CSDSetupWidgetExt()
*         * Cy_CapSense_CSDScan()
*         * Cy_CapSense_CSDScanExt()
*         * Cy_CapSense_CSDCalibrateWidget()
*         * Cy_CapSense_CSXSetupWidget()
*         * Cy_CapSense_CSXSetupWidgetExt()
*         * Cy_CapSense_CSXScan()
*         * Cy_CapSense_CSXScanExt()
*         * Cy_CapSense_CSXCalibrateWidget()
*
*         Two simple functions introduced to replace the listed above functions:
*         * Cy_CapSense_SetupWidgetExt()
*         * Cy_CapSense_ScanExt()
*     </td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>Fixed the shield operation when Csh is disabled</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Fixed the implementation of the position filtering for the Radial Slider widget</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Added restoring hardware to its default state in the Cy_CapSense_DeInit() implementation</td>
*     <td>Defect fixing</td>
*   </tr>
*   <tr>
*     <td>Added the capability to enable the shield electrode without dedicated electrodes</td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>Added support of a protocol-agnostic tuner interface (UART, SPI, etc.)</td>
*     <td>Feature enhancement</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>
*         The initial version
*     </td>
*     <td></td>
*   </tr>
* </table>
*
********************************************************************************
* \section section_capsense_more_information More Information
********************************************************************************
*
* Important information about the CAPSENSE&trade;-technology overview, device 
* from Infineon Technologies AG for the design, CAPSENSE&trade; system and sensor
* design guidelines, different interfaces and tuning guidelines necessary
* for a successful design of a CAPSENSE&trade; system is available in the Getting
* Started with CAPSENSE&trade; document and the product-specific CAPSENSE&trade; design guide.
* Infineon Technologies highly recommends starting with these documents. They can be
* found on the Infineon Technologies web site at www.infineon.com.
*
* For more information, refer to the following documents:
*
* * CAPSENSE&trade; Overview:
*
*   * <a href="https:/\/www.infineon.com/ModusToolboxCapSenseConfig"><b>ModusToolbox&trade;
*   CAPSENSE&trade; Configurator Tool Guide</b></a>
*
*   * <a href="https:/\/www.infineon.com/ModusToolboxCapSenseTuner"><b>ModusToolbox&trade;
*   CAPSENSE&trade; Tuner Tool Guide</b></a>
*
*   * <a href="https:/\/www.infineon.com/row/public/documents/30/42/infineon-an85951-psoc-4-psoc-6-capsense-design-guide-applicationnotes-en.pdf">
*   <b>CAPSENSE&trade; Design Guide</b></a>
*
* * ModusToolbox&trade; Overview:
*
*   * <a href="https:/\/www.infineon.com/cms/en/design-support/tools/sdk/modustoolbox-software">
*   <b>ModusToolbox&trade; Software Environment, Quick Start Guide, Documentation,
*   and Videos</b></a>
*
*   * <a href="https:/\/www.infineon.com/ModusToolboxDeviceConfig"><b>ModusToolbox&trade;
*   Device Configurator Tool Guide</b></a>
*
* * Infineon Technologies Kits and Code Examples:
*
*   * <a href="https:/\/github.com/Infineon/mbed-os-example-capsense">
*   <b>CAPSENSE&trade; buttons and slider for PSOC&trade; 6 MCU with Mbed OS</b></a>
*
*   * <a href="https:/\/github.com/Infineon/mtb-example-psoc6-capsense-buttons-slider-freertos">
*   <b>CAPSENSE&trade; Middleware Code Example for FreeRTOS</b></a>
*
*   * <a href="https:/\/www.infineon.com/evaluation-board/CY8CKIT-145-40XX">
*   <b>CY8CKIT-145-40XX PSOC&trade; 4000S CAPSENSE&trade; Prototyping Kit</b></a>
*
*   * <a href="https:/\/www.infineon.com/evaluation-board/CY8CKIT-149">
*   <b>CY8CKIT-149 PSOC&trade; 4100S Plus Prototyping Kit</b></a>
*
* * General Information:
*
*   * <a href="https:/\/infineon.github.io/mtb-pdl-cat1/pdl_api_reference_manual/html/index.html">
*   <b>CAT1 PDL API Reference</b></a>
*
*   * <a href="https:/\/infineon.github.io/mtb-pdl-cat2/pdl_api_reference_manual/html/index.html">
*   <b>CAT2 PDL API Reference</b></a>
*
*   * <a href="https:/\/documentation.infineon.com/psoc6/docs/rkg1651145413836">
*   <b>PSOC&trade; 6 Documentation</b></a>
*
*   * <a href="https:/\/documentation.infineon.com/psoc4/">
*   <b>PSOC&trade; 4 Documentation</b></a>
*
*   * <a href="https:/\/www.infineon.com/row/public/documents/30/42/infineon-an210781-getting-started-with-psoc-6-mcu-with-bluetooth-low-energy-ble-connectivity-applicationnotes-en.pdf"><b>AN210781 Getting Started with
*   PSOC&trade; 6 MCU with Bluetooth Low Energy (BLE) Connectivity</b></a>
*
*   * <a href="https:/\/www.infineon.com/row/public/documents/30/42/infineon-an215671-psoc-6-mcu-firmware-design-for-ble-applications-applicationnotes-en.pdf"><b>AN215671 PSOC&trade; 6 MCU
*   firmware design for BLE applications</b></a>
*
*   * <a href="https:/\/www.infineon.com/dgdl/Infineon-PSoC_6_MCU_PSoC_63_with_BLE_Architecture_Technical_Reference_Manual-AdditionalTechnicalInformation-v11_00-EN.pdf?fileId=8ac78c8c7d0d8da4017d0f946fea01ca">
*   <b>PSOC&trade; 6 Technical Reference Manual</b></a>
*
*   * <a href="https:/\/www.infineon.com/dgdl/Infineon-PSoC_6_MCU_PSoC_63_with_BLE_Datasheet_Programmable_System-on-Chip_(PSoC)-DataSheet-v16_00-EN.pdf?fileId=8ac78c8c7d0d8da4017d0ee4efe46c37">
*   <b>PSOC&trade; 63 with BLE Datasheet Programmable System-on-Chip datasheet</b></a>
*
*   * <a href="https:/\/www.infineon.com/assets/row/public/documents/30/57/infineon-psoc4000s-architecture-trm-additionaltechnicalinformation-en.pdf?fileId=8ac78c8c7d0d8da4017d0f915c737eb7">
*   <b>PSOC&trade; 4000S Family: PSOC&trade; 4 Architecture Technical Reference Manual (TRM)</b></a>
*
*   * <a href="https:/\/www.infineon.com/row/public/documents/30/57/infineon-psoc-4100s-and-psoc-4100s-plus-architecture-trm-additionaltechnicalinformation-en.pdf">
*   <b>PSOC&trade; 4100S and PSOC&trade; 4100S Plus: PSOC&trade; 4 Architecture Technical Reference Manual (TRM)</b></a>
*
*   * <a href="https:/\/github.com/Infineon"><b> Infineon Technologies GitHub</b></a>
*
*   * <a href="http:/\/www.infineon.com"><b>Infineon Technologies</b></a>
*
* \note
* The links to another software component's documentation (middleware and PDL)
* point to GitHub to the latest available version of the software.
* To get documentation of the specified version, download from GitHub and unzip
* the component archive. The documentation is available in the <i>docs</i> folder.
*
* \defgroup group_capsense_high_level               High-level Functions
*
* \defgroup group_capsense_low_level                Low-level Functions
*
* \defgroup group_capsense_data_structure           Data Structure
*
* \defgroup group_capsense_structures               Structures
* \ingroup group_capsense_data_structure
* \brief The CAPSENSE&trade; structures.
*
* \defgroup group_capsense_gesture_structures       Gesture Structures
* \ingroup group_capsense_data_structure
* \brief The Gesture-related structures.
*
* \defgroup group_capsense_enums                    Enumerated Types
*
* \defgroup group_capsense_macros                   Macros
*
* \defgroup group_capsense_macros_general           General Macros
*   \ingroup group_capsense_macros
*   \brief General macros
* \defgroup group_capsense_macros_mw_state          Middleware State Macros
*   \ingroup group_capsense_macros
*   \brief Middleware state macros
* \defgroup group_capsense_macros_status            Status Macros
*   \ingroup group_capsense_macros
*   \brief Status macros
* \defgroup group_capsense_macros_settings          Settings Macros
