zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense.h
*   \ingroup group_capsense_macros
*   \brief Settings macros
* \defgroup group_capsense_macros_pin               Pin-related Macros
*   \ingroup group_capsense_macros
*   \brief Pin-related macros
* \defgroup group_capsense_macros_process           Processing Macros
*   \ingroup group_capsense_macros
*   \brief Processing macros
* \defgroup group_capsense_macros_touch             Touch-related Macros
*   \ingroup group_capsense_macros
*   \brief Touch-related macros
* \defgroup group_capsense_macros_gesture           Gesture Macros
*   \ingroup group_capsense_macros
*   \brief Gesture macros
* \defgroup group_capsense_macros_miscellaneous     Miscellaneous Macros
*   \ingroup group_capsense_macros
*   \brief Miscellaneous macros
* \defgroup group_capsense_macros_bist              Built-in Self-test Macros
*   \ingroup group_capsense_macros
*   \brief Built-in Self-test macros
*
* \defgroup group_capsense_callbacks                Callbacks
*
* \cond SECTION_CAPSENSE_INTERNAL
* \defgroup group_capsense_internal                 Internal Functions
* \endcond
*
**/

/******************************************************************************/
/** \addtogroup group_capsense_high_level
* \{
*
* High-level functions represent the highest abstraction layer of
* the CAPSENSE&trade; middleware.
*
* These functions perform tasks such as scanning, data processing, data
* reporting and tuning interfaces. When performing a task, different
* initialization is required based on a sensing method or type of
* widgets is automatically handled by these functions. Therefore, these
* functions are sensing methods, features, and widget type agnostics.
* The only exception is the functions for low power widget scanning,
* they are available only for the fifth-generation low power CAPSENSE&trade;.
*
* All the tasks required to implement a sensing system can be fulfilled
* by the high-level functions. But, there is a set of
* \ref group_capsense_low_level that provides access to lower level
* and specific tasks. If a design requires access to low-level tasks,
* these functions can be used. The functions related to a given sensing
* methods are not available if the corresponding method is disabled.
*
* \} */

/******************************************************************************/
/** \addtogroup group_capsense_low_level
* \{
*
* The Low-level functions represent the lower layer of abstraction in
* support of \ref group_capsense_high_level.
*
* These functions also enable implementation of special case designs
* requiring performance optimization and non-typical functionalities.
*
* All functions are general to all sensing methods. Some of the
* functions detect the sensing method used by the widget and execute
* tasks as appropriate.
*
* \} */

/******************************************************************************/
/** \addtogroup group_capsense_macros
* \{
*
* Specifies constants used in the CAPSENSE&trade; middleware.
*
* \} */

/******************************************************************************/
/** \addtogroup group_capsense_enums
* \{
*
* Documents the CAPSENSE&trade; middleware related enumerated types.
*
* \} */

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal
* \{
*
* The section documents the CAPSENSE&trade; middleware related internal function.
*
* These function should not be used in the application program.
*
* \} \endcond */

/******************************************************************************/
/** \addtogroup group_capsense_data_structure
* \{
*
* The CAPSENSE&trade; Data Structure organizes configuration parameters, input, and
* output data shared among different FW modules within the CAPSENSE&trade;.
*
* The key responsibilities of the Data Structure are as follows:
* * The Data Structure is the only data container in the CAPSENSE&trade; middleware.
* * It serves as storage for the configuration and the output data.
* * All CAPSENSE&trade; modules use the data structure for the communication
*   and data exchange.
*
* The CAPSENSE&trade; Data Structure is a composite of several smaller structures
* (for global / common data, widget data, sensor data, and pin data).
* Furthermore, the data is split between RAM and Flash to achieve a
* reasonable balance between resources consumption and configuration / tuning
* flexibility at runtime and compile time. A graphical representation of
* the CAPSENSE&trade; Data Structure is shown below.
*
* Note that figure below shows a sample representation and documents the
* high-level design of the data structure, it does not include all the
* parameters and elements in each object.
*
* \image html capsense_ds.png "CAPSENSE&trade; Data Structure" width=800px
* \image latex capsense_ds.png
*
* CAPSENSE&trade; Data Structure does not perform error checking on the data
* written to CAPSENSE&trade; Data Structure. It is the responsibility of application
* program to ensure register map rule are not violated while
* modifying the value of data field in CAPSENSE&trade; Data Structure.
*
* Note: If the middleware configuration from the application program is changed
* by writing registers to the data structure, call the Cy_CapSense_Enable() function
* to repeat the initialization process.
*
* \} */

/******************************************************************************/
/** \addtogroup group_capsense_callbacks
* \{
*
* Callbacks allow the user to execute Custom code called from the CAPSENSE&trade;
* middleware when an event occurs. CAPSENSE&trade; supports several callbacks.
*
* <table>
*   <tr>
*     <th>#</th>
*     <th >Callback Name</th>
*     <th>Associated Register</th>
*     <th>Callback Function Prototype</th>
*     <th>Description</th>
*   </tr>
*   <tr>
*     <td>1</td>
*     <td>Start Sample</td>
*     <td>ptrSSCallback</td>
*     <td>\ref cy_capsense_callback_t</td>
*     <td>This is called before each sensor scan triggering. Such a callback
*         can be used to implement user-specific use cases like changing scan
*         parameters depending on whether a sensor is going to be scanned.
*       \par
*       * For fifth-generation low power CAPSENSE&trade; this callback is called
*         by CapSense MW before scan triggering. If a timeout to postpone a scan
*         is configured (using Cy_CapSense_ConfigureMsclpTimer() function) then callback
*         will be called before this timeout. The StartSample callback is called
*         only once before entire frame scan in Cy_CapSense_ScanSlots()
*         and Cy_CapSense_ScanLpSlots() functions.
*       \par
*       * For the fifth-generation CAPSENSE&trade; in CS-DMA mode this callback is called
*         only once in Cy_CapSense_ScanSlots() function with NULL passed as a parameter.
*         In INT driven mode it is called in Cy_CapSense_ScanSlots() and
*         in Cy_CapSense_ScanISR() function before HW starting the scan. </td>
*   </tr>
*   <tr>
*     <td>2</td>
*     <td>End Of Scan</td>
*     <td>ptrEOSCallback</td>
*     <td>\ref cy_capsense_callback_t</td>
*     <td>This is called after sensor scan completion and there is no other
*         sensor in the queue to be scanned.
*       \par
*       * For the fifth-generation low power CAPSENSE&trade; this callback is called
*         with NULL passed as a parameter.</td>
*       \par
*       * For the fifth-generation CAPSENSE&trade; in CS-DMA mode this callback is called
*         with NULL passed as a parameter.</td>
*   </tr>
*   <tr>
*     <td>3</td>
*     <td>Tuner Send Callback</td>
*     <td>ptrTunerSendCallback</td>
*     <td>\ref cy_capsense_tuner_send_callback_t</td>
*     <td>This is called by the Cy_CapSense_RunTuner() function to establish
*         synchronous communication with the Tuner tool.
*       \par
*       * For the fifth-generation low power CAPSENSE&trade; the callback is called only once for each new scan.
*       \par
*       * For the previous CAPSENSE&trade; generations the callback is called once per scan cycle or periodically if device is in suspended mode.</td>
*   </tr>
*   <tr>
*     <td>4</td>
*     <td>Tuner Receive Callback</td>
*     <td>ptrTunerReceiveCallback</td>
*     <td>\ref cy_capsense_tuner_receive_callback_t</td>
*     <td>This is called by the Cy_CapSense_RunTuner() function to establish
*         synchronous communication with the Tuner tool.
*         </td>
*   </tr>
*   <tr>
*     <td>5</td>
*     <td>CAPSENSE&trade; Data Structure Initialization Callback</td>
*     <td>ptrEODsInitCallback</td>
*     <td>\ref cy_capsense_ds_init_callback_t</td>
*     <td>This is called by the Cy_CapSense_Enable() function after CAPSENSE&trade;
*         Data Structure initialization complete and before launching
*         the first initialization scan. Using this callback is not
*         recommended. It is used only to implement only user's
*         specific use cases (while changing the CAPSENSE&trade;
*         default configuration).
*       \par
*       * The callback is available for Fifth Generation CAPSENSE&trade; and
*         Fifth Generation low power CAPSENSE&trade; devices.</td>
*   </tr>
* </table>
*
* \note
* Callbacks 1 and 2 are called by the Cy_CapSense_InterruptHandler()
* function and lengthen this function execution. Usually,
* Cy_CapSense_InterruptHandler() is called inside the ISR.
* Then these callbacks also lengthen the ISR execution.
*
* All callbacks can be registered by direct assignment of the function
* pointers to the corresponding CAPSENSE&trade; Data Structure field after call of
* the Cy_CapSense_Init() function as follows:
*  *
* <tt>context-\>ptrInternalContext-\>\<Associated Register\> = \&CallbackFunction;</tt>
*
* Callbacks 1 and 2 can be registered / unregistered using
* the Cy_CapSense_RegisterCallback() and Cy_CapSense_UnRegisterCallback()
* functions.
*
* \} */


#if !defined(CY_CAPSENSE_H)
#define CY_CAPSENSE_H

#include "cy_device_headers.h"
#include "cy_capsense_common.h"
#include "cy_capsense_centroid.h"
#include "cy_capsense_control.h"
#include "cy_capsense_filter.h"
#include "cy_capsense_lib.h"
#include "cy_capsense_gesture_lib.h"
#include "cy_capsense_processing.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_tuner.h"
#include "cy_capsense_sensing.h"
#include "cy_capsense_selftest.h"
#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    #include "cy_capsense_csd_v2.h"
    #include "cy_capsense_csx_v2.h"
    #include "cy_capsense_sensing_v2.h"
    #include "cy_capsense_selftest_v2.h"
#elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    #include "cy_capsense_generator_v3.h"
    #include "cy_capsense_sensing_v3.h"
    #include "cy_capsense_selftest_v3.h"
    #include "cy_capsense_sm_base_full_wave_v3.h"
#elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    #include "cy_capsense_generator_lp.h"
    #include "cy_capsense_sensing_lp.h"
    #include "cy_capsense_selftest_lp.h"
    #include "cy_capsense_sm_base_full_wave_lp.h"
#else
    /* Supported platform not found */
#endif

#endif /* CY_CAPSENSE_H */


/* [] END OF FILE */
